Repository: ilyadreamix25/helpme
Catalog: assets/l10n/app_*.arb
Languages: ru, uk

# doYouNeedHelp
source: Do you need help? Tell about it!
ru: Вам нужна помощь? Расскажите об этом!
uk: Вам потрібна допомога? Розкажіть про це!

# weWillHelp
source: We and our friends will help you deal with your problems!
ru: Мы и наши друзья помогут вам разобраться со своими проблемами!
uk: Ми та наші друзі допоможуть вам розібратися зі своїми проблемами!

source: Sign In
ru: Вход
uk: Вхід

source: Sign Up
ru: Регистрация
uk: Реєстрація

source: Start with Google Account
ru: Начать с аккаунтом Google
uk: Почати з акаунтом Google

source: Start with Apple ID
ru: Начать с Apple ID
uk: Почати з Apple ID

# itWontTakeLong
source: Login first. It won't take long!
ru: Для начала нужно войти. Это не займет много времени!
uk: Для початку потрібно увійти. Це не займе багато часу!

source: Close
ru: Закрыть
uk: Закрити

source: Are you already with us?
ru: Вы уже с нами?
uk: Ви вже з нами?

source: Service unavailable!
ru: Сервис недоступен!
uk: Сервіс недоступний!

# serviceUnavailableFull
source: This service is unavailable right now. Please try again later
ru: Этот сервис не доступен в данный момент. Попробуйте ещё раз позже
uk: Цей сервіс не доступний в даний момент. Спробуйте ще раз пізніше

# slogan
source: There will always be people who can help you!
ru: Всегда найдутся люди, которые смогут вам помочь!
uk: Завжди знайдуться люди, які зможуть вам допомогти!

# version
source: Created by IlyaDreamix, 2023 Version {version} ({versionCode})
ru: Создатель: IlyaDreamix, 2023 Версия {version} ({versionCode})
uk: Автор: IlyaDreamix, 2023 Версія {version} ({versionCode})

source: About
ru: О приложении
uk: Про додаток

# weHaveBeenWaiting
source: We have been waiting for you for a long time!
ru: Мы вас уже заждались!
uk: Ми вас вже зачекалися!

# provideSomeInfo
source: Provide some information about yourself
ru: Предоставьте немного информации о себе
uk: Надайте трохи інформації про себе

source: Nickname
ru: Никнейм
uk: Нікнейм

# nicknameRules
source: 6-24 symbols A-Z, a-z, numbers and underscores
ru: 6-24 символов A-Z, a-z, числа и нижние подчеркивания
uk: 6-24 символів A-Z, a-z, числа та нижні підкреслення

source: Age
ru: Возраст
uk: Вік

source: (Optional)
ru: (Необязательно)
uk: (Необов'язково)

# continueButton
source: Continue
ru: Продолжить
uk: Продовжити

source: Invalid value
ru: Неверное значение
uk: Неправильне значення

# requiredValue
source: (Required)
ru: (Обязательно)
uk: (Обов'язково)

source: Now it's time for safety
ru: Теперь настало время для безопасности
uk: Тепер настав час для безпеки

# comeUpWithPin
source: Come up with and remember a PIN code to enter the HelpMe app
ru: Придумайте и запомните PIN-код для входа в приложение
uk: Придумайте та запам'ятайте PIN-код для входу в додаток

# pinWarning
source: Keep in mind that this PIN will be used every time you log into your account in the future
ru: Помните, что этот PIN-код будет использоваться в будущем при каждом входе в ваш аккаунт
uk: Пам'ятайте, що цей PIN-код буде використовуватися в майбутньому при кожному вході у обліковий запис

source: Finish
ru: Завершить
uk: Завершити

# nicknameUnavaliable
source: This nickname is not available
uk: Цей нікнейм недоступний

source: Oops...
ru: Упс...
uk: Упс...

source: Welcome back!
ru: С возвращением!
uk: З поверненням!

# callToMindPinCode
source: Call to mind the PIN code that you specified during registration
ru: Вспомните PIN-код который вы указали во время регистрации
uk: Згадайте PIN-код який ви вказали під час реєстрації

# stateOk
source: Ok
ru: Ок
uk: Ок

# stateInternalServerError
source: Internal server error. Please try again later
ru: Внутренняя ошибка сервера. Пожалуйста, попробуйте еще раз позже
uk: Внутрішня помилка сервера. Будь ласка, спробуйте ще раз пізніше

# stateInvalidRequest
source: Invalid request. Please update the app to the latest version
ru: Неверный запрос. Пожалуйста, обновите приложение до последней версии
uk: Неправильний запит. Будь ласка, оновіть додаток до останньої версії

# stateContentNotFound
source: Content not found
ru: Контент не найден
uk: Контент не знайдено

# stateInvalidMethod
source: Invalid method. Please update the app to the latest version
ru: Неверный метод. Пожалуйста, обновите приложение до последней версии
uk: Неправильний метод. Будь ласка, оновіть додаток до останньої версії

# stateServiceUnavailable
source: Service unavailable. Please update the app to the latest version
ru: Сервис недоступен. Пожалуйста, обновите приложение до последней версии
uk: Сервіс недоступний. Будь ласка, оновіть додаток до останньої версії

# stateUserAlreadyExists
source: User with this email already exists. Please sign in
ru: Пользователь с таким электронным адресом уже существует. Пожалуйста, войдите в свой аккаунт
uk: Користувач з такою електронною адресою вже існує. Будь ласка, увійдіть до свого облікового запису

# stateUserDoesNotExist
source: User does not exist
ru: Пользователь не существует
uk: Користувач не існує

# stateUnauthorized
source: Session expired. Please relogin
ru: Сессия истекла. Пожалуйста, выполните повторную авторизацию
uk: Сесія закінчилася. Будь ласка, виконайте повторну авторизацію

# stateInvalidCredentials
source: Invalid credentials (PIN code is incorrect)
ru: Неверные учетные данные (неправильный PIN-код)
uk: Неправильні облікові дані (неправильний PIN-код)

# stateTooManyRequests
source: Too many requests. Please try again later
ru: Слишком много запросов. Пожалуйста, попробуйте еще раз позже
uk: Занадто багато запитів. Будь ласка, спробуйте ще раз пізніше

# stateTooYoung
source: You are too young! Come back when you're 14
ru: Вы слишком молоды! Возвращайтесь, когда вам исполнится 14 лет
uk: Ви ще замалі! Повертайтеся, коли вам виповниться 14 років

# stateNicknameUnavailable
source: This nickname is not available
ru: Этот никнейм недоступен
uk: Цей нікнейм недоступний

# stateInvalidIdToken
source: Invalid request. Please update the app to the latest version
ru: Неверный запрос. Пожалуйста, обновите приложение до последней версии
uk: Неправильний запит. Будь ласка, оновіть додаток до останньої версії

# stateEmailIsNotVerified
source: Your email is not verified
ru: Ваш электронный адрес не подтвержден
uk: Ваша електронна адреса не підтверджена

# stateYouAreBanned
source: You are banned
ru: Вы были забанены за нарушение правил платформы
uk: Ви були забанені за порушення правил платформи

# stateUnknownState
source: Unknown error, please try again later
ru: Неизвестная ошибка, пожалуйста, попробуйте ещё раз позже
uk: Невідома помилка, будь ласка, спробуйте ще раз пізніше
